//=============================================================================
//
// サウンド処理 [sound.h]
//
//=============================================================================
#pragma once

#include <XAudio2.h>

//*****************************************************************************
// サウンドファイル
//*****************************************************************************
enum SOUND_LABEL
{
	SOUND_LABEL_TITLE,
	SOUND_LABEL_GAME,
	SOUND_LABEL_MAX,
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitSound(HWND hWnd);
void UninitSound(void);
HRESULT PlaySound(SOUND_LABEL label);
void StopSound(SOUND_LABEL label);
void StopSound(void);
